espressif/esp-idf/components/soc/esp32c5/register/soc/tee_reg.h
/** TEE_INTPRI_REG_CTRL_REG register
 *  INTPRI_REG read/write control register
 */
#define TEE_INTPRI_REG_CTRL_REG (DR_REG_TEE_BASE + 0x12c)
/** TEE_READ_TEE_INTPRI_REG : R/W; bitpos: [0]; default: 1;
 *  Configures intpri_reg registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_INTPRI_REG    (BIT(0))
#define TEE_READ_TEE_INTPRI_REG_M  (TEE_READ_TEE_INTPRI_REG_V << TEE_READ_TEE_INTPRI_REG_S)
#define TEE_READ_TEE_INTPRI_REG_V  0x00000001U
#define TEE_READ_TEE_INTPRI_REG_S  0
/** TEE_READ_REE0_INTPRI_REG : R/W; bitpos: [1]; default: 0;
 *  Configures intpri_reg registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_INTPRI_REG    (BIT(1))
#define TEE_READ_REE0_INTPRI_REG_M  (TEE_READ_REE0_INTPRI_REG_V << TEE_READ_REE0_INTPRI_REG_S)
#define TEE_READ_REE0_INTPRI_REG_V  0x00000001U
#define TEE_READ_REE0_INTPRI_REG_S  1
/** TEE_READ_REE1_INTPRI_REG : R/W; bitpos: [2]; default: 0;
 *  Configures intpri_reg registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_INTPRI_REG    (BIT(2))
#define TEE_READ_REE1_INTPRI_REG_M  (TEE_READ_REE1_INTPRI_REG_V << TEE_READ_REE1_INTPRI_REG_S)
#define TEE_READ_REE1_INTPRI_REG_V  0x00000001U
#define TEE_READ_REE1_INTPRI_REG_S  2
/** TEE_READ_REE2_INTPRI_REG : R/W; bitpos: [3]; default: 0;
 *  Configures intpri_reg registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_INTPRI_REG    (BIT(3))
#define TEE_READ_REE2_INTPRI_REG_M  (TEE_READ_REE2_INTPRI_REG_V << TEE_READ_REE2_INTPRI_REG_S)
#define TEE_READ_REE2_INTPRI_REG_V  0x00000001U
#define TEE_READ_REE2_INTPRI_REG_S  3
/** TEE_WRITE_TEE_INTPRI_REG : R/W; bitpos: [4]; default: 1;
 *  Configures intpri_reg registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_INTPRI_REG    (BIT(4))
#define TEE_WRITE_TEE_INTPRI_REG_M  (TEE_WRITE_TEE_INTPRI_REG_V << TEE_WRITE_TEE_INTPRI_REG_S)
#define TEE_WRITE_TEE_INTPRI_REG_V  0x00000001U
#define TEE_WRITE_TEE_INTPRI_REG_S  4
/** TEE_WRITE_REE0_INTPRI_REG : R/W; bitpos: [5]; default: 0;
 *  Configures intpri_reg registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_INTPRI_REG    (BIT(5))
#define TEE_WRITE_REE0_INTPRI_REG_M  (TEE_WRITE_REE0_INTPRI_REG_V << TEE_WRITE_REE0_INTPRI_REG_S)
#define TEE_WRITE_REE0_INTPRI_REG_V  0x00000001U
#define TEE_WRITE_REE0_INTPRI_REG_S  5
/** TEE_WRITE_REE1_INTPRI_REG : R/W; bitpos: [6]; default: 0;
 *  Configures intpri_reg registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_INTPRI_REG    (BIT(6))
#define TEE_WRITE_REE1_INTPRI_REG_M  (TEE_WRITE_REE1_INTPRI_REG_V << TEE_WRITE_REE1_INTPRI_REG_S)
#define TEE_WRITE_REE1_INTPRI_REG_V  0x00000001U
#define TEE_WRITE_REE1_INTPRI_REG_S  6
/** TEE_WRITE_REE2_INTPRI_REG : R/W; bitpos: [7]; default: 0;
 *  Configures intpri_reg registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_INTPRI_REG    (BIT(7))
#define TEE_WRITE_REE2_INTPRI_REG_M  (TEE_WRITE_REE2_INTPRI_REG_V << TEE_WRITE_REE2_INTPRI_REG_S)
#define TEE_WRITE_REE2_INTPRI_REG_V  0x00000001U
#define TEE_WRITE_REE2_INTPRI_REG_S  7

/** TEE_TWAI1_CTRL_REG register
 *  TWAI1 read/write control register
 */
#define TEE_TWAI1_CTRL_REG (DR_REG_TEE_BASE + 0x138)
/** TEE_READ_TEE_TWAI1 : R/W; bitpos: [0]; default: 1;
 *  Configures can1 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_TWAI1    (BIT(0))
#define TEE_READ_TEE_TWAI1_M  (TEE_READ_TEE_TWAI1_V << TEE_READ_TEE_TWAI1_S)
#define TEE_READ_TEE_TWAI1_V  0x00000001U
#define TEE_READ_TEE_TWAI1_S  0
/** TEE_READ_REE0_TWAI1 : R/W; bitpos: [1]; default: 0;
 *  Configures can1 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_TWAI1    (BIT(1))
#define TEE_READ_REE0_TWAI1_M  (TEE_READ_REE0_TWAI1_V << TEE_READ_REE0_TWAI1_S)
#define TEE_READ_REE0_TWAI1_V  0x00000001U
#define TEE_READ_REE0_TWAI1_S  1
/** TEE_READ_REE1_TWAI1 : R/W; bitpos: [2]; default: 0;
 *  Configures can1 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_TWAI1    (BIT(2))
#define TEE_READ_REE1_TWAI1_M  (TEE_READ_REE1_TWAI1_V << TEE_READ_REE1_TWAI1_S)
#define TEE_READ_REE1_TWAI1_V  0x00000001U
#define TEE_READ_REE1_TWAI1_S  2
/** TEE_READ_REE2_TWAI1 : R/W; bitpos: [3]; default: 0;
 *  Configures can1 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_TWAI1    (BIT(3))
#define TEE_READ_REE2_TWAI1_M  (TEE_READ_REE2_TWAI1_V << TEE_READ_REE2_TWAI1_S)
#define TEE_READ_REE2_TWAI1_V  0x00000001U
#define TEE_READ_REE2_TWAI1_S  3
/** TEE_WRITE_TEE_TWAI1 : R/W; bitpos: [4]; default: 1;
 *  Configures can1 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_TWAI1    (BIT(4))
#define TEE_WRITE_TEE_TWAI1_M  (TEE_WRITE_TEE_TWAI1_V << TEE_WRITE_TEE_TWAI1_S)
#define TEE_WRITE_TEE_TWAI1_V  0x00000001U
#define TEE_WRITE_TEE_TWAI1_S  4
/** TEE_WRITE_REE0_TWAI1 : R/W; bitpos: [5]; default: 0;
 *  Configures can1 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_TWAI1    (BIT(5))
#define TEE_WRITE_REE0_TWAI1_M  (TEE_WRITE_REE0_TWAI1_V << TEE_WRITE_REE0_TWAI1_S)
#define TEE_WRITE_REE0_TWAI1_V  0x00000001U
#define TEE_WRITE_REE0_TWAI1_S  5
/** TEE_WRITE_REE1_TWAI1 : R/W; bitpos: [6]; default: 0;
 *  Configures can1 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_TWAI1    (BIT(6))
#define TEE_WRITE_REE1_TWAI1_M  (TEE_WRITE_REE1_TWAI1_V << TEE_WRITE_REE1_TWAI1_S)
#define TEE_WRITE_REE1_TWAI1_V  0x00000001U
#define TEE_WRITE_REE1_TWAI1_S  6
/** TEE_WRITE_REE2_TWAI1 : R/W; bitpos: [7]; default: 0;
 *  Configures can1 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_TWAI1    (BIT(7))
#define TEE_WRITE_REE2_TWAI1_M  (TEE_WRITE_REE2_TWAI1_V << TEE_WRITE_REE2_TWAI1_S)
#define TEE_WRITE_REE2_TWAI1_V  0x00000001U
#define TEE_WRITE_REE2_TWAI1_S  7

/** TEE_SPI2_CTRL_REG register
 *  SPI2 read/write control register
 */
#define TEE_SPI2_CTRL_REG (DR_REG_TEE_BASE + 0x13c)
/** TEE_READ_TEE_SPI2 : R/W; bitpos: [0]; default: 1;
 *  Configures spi2 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_SPI2    (BIT(0))
#define TEE_READ_TEE_SPI2_M  (TEE_READ_TEE_SPI2_V << TEE_READ_TEE_SPI2_S)
#define TEE_READ_TEE_SPI2_V  0x00000001U
#define TEE_READ_TEE_SPI2_S  0
/** TEE_READ_REE0_SPI2 : R/W; bitpos: [1]; default: 0;
 *  Configures spi2 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_SPI2    (BIT(1))
#define TEE_READ_REE0_SPI2_M  (TEE_READ_REE0_SPI2_V << TEE_READ_REE0_SPI2_S)
#define TEE_READ_REE0_SPI2_V  0x00000001U
#define TEE_READ_REE0_SPI2_S  1
/** TEE_READ_REE1_SPI2 : R/W; bitpos: [2]; default: 0;
 *  Configures spi2 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_SPI2    (BIT(2))
#define TEE_READ_REE1_SPI2_M  (TEE_READ_REE1_SPI2_V << TEE_READ_REE1_SPI2_S)
#define TEE_READ_REE1_SPI2_V  0x00000001U
#define TEE_READ_REE1_SPI2_S  2
/** TEE_READ_REE2_SPI2 : R/W; bitpos: [3]; default: 0;
 *  Configures spi2 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_SPI2    (BIT(3))
#define TEE_READ_REE2_SPI2_M  (TEE_READ_REE2_SPI2_V << TEE_READ_REE2_SPI2_S)
#define TEE_READ_REE2_SPI2_V  0x00000001U
#define TEE_READ_REE2_SPI2_S  3
/** TEE_WRITE_TEE_SPI2 : R/W; bitpos: [4]; default: 1;
 *  Configures spi2 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_SPI2    (BIT(4))
#define TEE_WRITE_TEE_SPI2_M  (TEE_WRITE_TEE_SPI2_V << TEE_WRITE_TEE_SPI2_S)
#define TEE_WRITE_TEE_SPI2_V  0x00000001U
#define TEE_WRITE_TEE_SPI2_S  4
/** TEE_WRITE_REE0_SPI2 : R/W; bitpos: [5]; default: 0;
 *  Configures spi2 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_SPI2    (BIT(5))
#define TEE_WRITE_REE0_SPI2_M  (TEE_WRITE_REE0_SPI2_V << TEE_WRITE_REE0_SPI2_S)
#define TEE_WRITE_REE0_SPI2_V  0x00000001U
#define TEE_WRITE_REE0_SPI2_S  5
/** TEE_WRITE_REE1_SPI2 : R/W; bitpos: [6]; default: 0;
 *  Configures spi2 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_SPI2    (BIT(6))
#define TEE_WRITE_REE1_SPI2_M  (TEE_WRITE_REE1_SPI2_V << TEE_WRITE_REE1_SPI2_S)
#define TEE_WRITE_REE1_SPI2_V  0x00000001U
#define TEE_WRITE_REE1_SPI2_S  6
/** TEE_WRITE_REE2_SPI2 : R/W; bitpos: [7]; default: 0;
 *  Configures spi2 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_SPI2    (BIT(7))
#define TEE_WRITE_REE2_SPI2_M  (TEE_WRITE_REE2_SPI2_V << TEE_WRITE_REE2_SPI2_S)
#define TEE_WRITE_REE2_SPI2_V  0x00000001U
#define TEE_WRITE_REE2_SPI2_S  7

/** TEE_BS_CTRL_REG register
 *  BITSCRAMBLER read/write control register
 */
#define TEE_BS_CTRL_REG (DR_REG_TEE_BASE + 0x140)
/** TEE_READ_TEE_BS : R/W; bitpos: [0]; default: 1;
 *  Configures bs registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_TEE_BS    (BIT(0))
#define TEE_READ_TEE_BS_M  (TEE_READ_TEE_BS_V << TEE_READ_TEE_BS_S)
#define TEE_READ_TEE_BS_V  0x00000001U
#define TEE_READ_TEE_BS_S  0
/** TEE_READ_REE0_BS : R/W; bitpos: [1]; default: 0;
 *  Configures bs registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE0_BS    (BIT(1))
#define TEE_READ_REE0_BS_M  (TEE_READ_REE0_BS_V << TEE_READ_REE0_BS_S)
#define TEE_READ_REE0_BS_V  0x00000001U
#define TEE_READ_REE0_BS_S  1
/** TEE_READ_REE1_BS : R/W; bitpos: [2]; default: 0;
 *  Configures bs registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE1_BS    (BIT(2))
#define TEE_READ_REE1_BS_M  (TEE_READ_REE1_BS_V << TEE_READ_REE1_BS_S)
#define TEE_READ_REE1_BS_V  0x00000001U
#define TEE_READ_REE1_BS_S  2
/** TEE_READ_REE2_BS : R/W; bitpos: [3]; default: 0;
 *  Configures bs registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define TEE_READ_REE2_BS    (BIT(3))
#define TEE_READ_REE2_BS_M  (TEE_READ_REE2_BS_V << TEE_READ_REE2_BS_S)
#define TEE_READ_REE2_BS_V  0x00000001U
#define TEE_READ_REE2_BS_S  3
/** TEE_WRITE_TEE_BS : R/W; bitpos: [4]; default: 1;
 *  Configures bs registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_TEE_BS    (BIT(4))
#define TEE_WRITE_TEE_BS_M  (TEE_WRITE_TEE_BS_V << TEE_WRITE_TEE_BS_S)
#define TEE_WRITE_TEE_BS_V  0x00000001U
#define TEE_WRITE_TEE_BS_S  4
/** TEE_WRITE_REE0_BS : R/W; bitpos: [5]; default: 0;
 *  Configures bs registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE0_BS    (BIT(5))
#define TEE_WRITE_REE0_BS_M  (TEE_WRITE_REE0_BS_V << TEE_WRITE_REE0_BS_S)
#define TEE_WRITE_REE0_BS_V  0x00000001U
#define TEE_WRITE_REE0_BS_S  5
/** TEE_WRITE_REE1_BS : R/W; bitpos: [6]; default: 0;
 *  Configures bs registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE1_BS    (BIT(6))
#define TEE_WRITE_REE1_BS_M  (TEE_WRITE_REE1_BS_V << TEE_WRITE_REE1_BS_S)
#define TEE_WRITE_REE1_BS_V  0x00000001U
#define TEE_WRITE_REE1_BS_S  6
/** TEE_WRITE_REE2_BS : R/W; bitpos: [7]; default: 0;
 *  Configures bs registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define TEE_WRITE_REE2_BS    (BIT(7))
#define TEE_WRITE_REE2_BS_M  (TEE_WRITE_REE2_BS_V << TEE_WRITE_REE2_BS_S)
#define TEE_WRITE_REE2_BS_V  0x00000001U
#define TEE_WRITE_REE2_BS_S  7

/** TEE_BUS_ERR_CONF_REG register
 *  Error message return configuration register
 */
#define TEE_BUS_ERR_CONF_REG (DR_REG_TEE_BASE + 0xff0)
/** TEE_BUS_ERR_RESP_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether to return error message to CPU when access is blocked.
 *  0: Disable
 *  1: Enable
 */
#define TEE_BUS_ERR_RESP_EN    (BIT(0))
#define TEE_BUS_ERR_RESP_EN_M  (TEE_BUS_ERR_RESP_EN_V << TEE_BUS_ERR_RESP_EN_S)
#define TEE_BUS_ERR_RESP_EN_V  0x00000001U
#define TEE_BUS_ERR_RESP_EN_S  0

/** TEE_CLOCK_GATE_REG register
 *  Clock gating register
 */
#define TEE_CLOCK_GATE_REG (DR_REG_TEE_BASE + 0xff8)
/** TEE_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether to keep the clock always on.
 *  0: Enable automatic clock gating
 *  1: Keep the clock always on
 */
#define TEE_CLK_EN    (BIT(0))
#define TEE_CLK_EN_M  (TEE_CLK_EN_V << TEE_CLK_EN_S)
#define TEE_CLK_EN_V  0x00000001U
#define TEE_CLK_EN_S  0

/** TEE_DATE_REG register
 *  Version control register
 */
#define TEE_DATE_REG (DR_REG_TEE_BASE + 0xffc)
/** TEE_DATE : R/W; bitpos: [27:0]; default: 37773824;
 *  Version control register.
 */
#define TEE_DATE    0x0FFFFFFFU
#define TEE_DATE_M  (TEE_DATE_V << TEE_DATE_S)
#define TEE_DATE_V  0x0FFFFFFFU
#define TEE_DATE_S  0

#ifdef __cplusplus
}
#endif
